// =====================================================
// USAR LA BASE DE DATOS
// =====================================================

use("streamhub");

// =====================================================
// PELÍCULAS CON DURACIÓN MAYOR A 120 MIN
// ($gt)
// =====================================================

db.peliculas.find({

    duracion: { $gt: 120 }

});

// =====================================================
// PELÍCULAS CON DURACIÓN MENOR A 100 MIN
// ($lt)
// =====================================================

db.peliculas.find({

    duracion: { $lt: 100 }

});

// =====================================================
// PELÍCULAS DEL GÉNERO ACCIÓN
// ($eq)
// =====================================================

db.peliculas.find({

    genero: { $eq: "Acción" }

});

// =====================================================
// PELÍCULAS DE ACCIÓN O CIENCIA FICCIÓN
// ($in)
// =====================================================

db.peliculas.find({

    genero: {

        $in: ["Acción", "Ciencia Ficción"]

    }

});

// =====================================================
// PELÍCULAS DE MÁS DE 120 MINUTOS
// Y PUBLICADAS DESPUÉS DEL AÑO 2000
// ($and)
// =====================================================

db.peliculas.find({

    $and: [

        { duracion: { $gt: 120 } },

        { anio: { $gt: 2000 } }

    ]

});

// =====================================================
// PELÍCULAS DE DRAMA O ANIMACIÓN
// ($or)
// =====================================================

db.peliculas.find({

    $or: [

        { genero: "Drama" },

        { genero: "Animación" }

    ]

});

// =====================================================
// TÍTULOS QUE COMIENCEN POR "T"
// ($regex)
// =====================================================

db.peliculas.find({

    titulo: {

        $regex: "^T"

    }

});

// =====================================================
// USUARIOS QUE HAN VISTO MÁS DE 5 CONTENIDOS
// =====================================================

db.usuarios.find({

    contenidos_vistos: {

        $gt: 5

    }

}); 